# # 1. Установите Python и PyCharm
# # 2.  Напишите и запустите программу. которая выводит строку  "Hello world!"
#
# print('Hello, world!')
#
# # 3. Напишите программу, которая на входе получает имя пользователя, cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"
#
# user_name = input("Please, fill user name: ")
# print(f"Hello, {user_name}!")

# # 4. Напишите программу, которая на входе получает 2 числа, производит с ними арифметическую операцию(на ваше усмотрение), и выводит “Результат = {результат}”.
#
# num1 = int(input("Input digit 1: "))
# num2 = int(input("Input digit 2: "))
# result = num1 + num2
# print(f"Result={result}")

5
print('*******')
print('*     *')
print('*     *')
print('*******')

print('*******\n*     *\n*     *\n*******')

print("""*******
*     *
*     *
*******""")